Revit 2026 API

# HermiteSurfaceIsValid Method

---

Checks whether this HermiteSurface object is valid.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public bool IsValid()
```
```vb
Public Function IsValid As Boolean
```
```cpp
public:
bool IsValid()
```
```fsharp
member IsValid : unit -> bool
```

#### Return Value

Boolean True if this is a valid Hermite Surface, false otherwise.

An attempt to access or compute data in an invalid Hermite Surface will cause an exception.

#### Reference

HermiteSurface Class

Autodesk.Revit.DB Namespace